Repository: solovyevn/CustomDKGMonitor
Catalog: CustomDKGMonitor_project/WinFormStrings.*.resx
Languages: ru

# strAlarmDisabled
source: Alarm DISABLED!
ru: Сигнализация ВЫКЛЮЧЕНА!

# strAlarmEnabled
source: Alarm ENABLED!
ru: Сигнализация ВКЛЮЧЕНА!

# strAlarmExcl
source: !ALARM!
ru: !Тревога!

# strAlarmSoundOff
source: Alarm stopped ringing!
ru: Звуковое оповещение остановлено!

# strAlarmSoundOn
source: Alarm ringing!
ru: Звуковое оповещение воспроизводится!

# strAlarmStillEnabled
source: Alarm still enabled!
ru: Сигнализация все еще включена!

# strCoolantTemp
source: Coolant Temp
ru: Температура охлаждающей жидкости

# strDisableAlarm
source: Disable Alarm
ru: Выкл. звуковой сигнал

# strDisAlarmBeforeStop
source: Disable the alarm before stopping the monitoring process!
ru: Выключите сигнализацию прежде чем отключать мониторинг!

# strDKGDT
source: DKG DateTime
ru: Дата и время на устройстве

# strEnableAlarm
source: Enable Alarm
ru: Вкл. звуковой сигнал

# strErrAccessLog
source: Error accessing log file!
ru: Ошибка доступа к файлу лога!

# strErrEnumPorts
source: Error enumerating serial ports!
ru: Ошибка получения списка портов!

# strErrInSettings
source: Error in settings!
ru: Ошибка в настройках!

# strErrLoadSound
source: Error loading sound file!
ru: Ошибка загрузки звукового файла!

# strErrOpenPort
source: Error opening port!
ru: Ошибка при открытии порта!

# strInitErr
source: Initialization error!
ru: Ошибка инициализации!

# strIsStopped
source: is stopped!
ru: отключен!

# strLastDataUpd
source: Last data update
ru: Последнее обновление данных

# strMakeSurePorts
source: Make sure you have working serial ports on this machine, or restart your system and try again!
ru: Убедитесь, что на данной машине имеются последовательные порты, или перезагрузите систему и попробуйте снова.

# strNA
source: n/a
ru: н/д

# strNoDataFor
source: No data over serial port for
ru: Нет данных на порту в течении

# strOutLimit
source: is out of limits!
ru: за пределами!

# strParseErr
source: Error parsing data!
ru: Ошибка обработки данных!

# strPortClose
source: Port closed!
ru: Порт закрыт!

# strPortOpen
source: Port opened!
ru: Порт открыт!

# strRecieveErr
source: Data receive error.
ru: Ошибка приема данных.

# strRunning
source: is running...
ru: работает...

# strSeconds
source: seconds
ru: секунд

# strSerialIsOpened
source: Serial port is open
ru: Порт открыт

# strSerialStillOpen
source: Serial port is still open! Do you want to close the port automatically and exit the program?
ru: Порт все еще открыт! Вы хотите закрыть порт автоматически и выйти из программы?

# strSkipData
source: Skipping data with InnerBuffer flush.
ru: Пропускаю данные, очищаю InnerBuffer.

# strStart
source: Start
ru: Запустить

# strStarted
source: Started.
ru: Запущен.

# strStop
source: Stop
ru: Отключить

# strStopped
source: Stopped.
ru: Отключен.

# strTryDelSet
source: Try deleting settings file and restarting the program.
ru: Попробуйте удалить файл настроек и перезапустите программу.

# strDataFlowRestored
source: Data flow over port restored
ru: Поток данных через порт восстановлен
